Interface.Post.Goods.Issue.CDM.To.Belkin/Tests/DevQ2QTestInputs/DevQ2QBelkinTestInput001.xml

<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header></SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:PostGoodsIssue xmlns:ns1="http://linfoxintegration.com/horizon/postgoodsissue/1.0">
            <ns1:MessageHeader>
                <ns1:ID>PICKS00998</ns1:ID>
                <ns1:CreationDate>2017-05-12T11:59:33</ns1:CreationDate>
                <ns1:GLNCode>22868</ns1:GLNCode>
                <ns1:CustomerName>228683</ns1:CustomerName>
                <ns1:WarehouseLocationCode>NSW1</ns1:WarehouseLocationCode>
                <ns1:TestIndicator>T</ns1:TestIndicator>
            </ns1:MessageHeader>
            <ns1:GIHeader>
                <ns1:LfxShpOdrNbr>2286862331998</ns1:LfxShpOdrNbr>
                <ns1:PrmCustShpOdrNbr>2286862331998</ns1:PrmCustShpOdrNbr>
                <ns1:SalesOrderNumber>6246M44384381</ns1:SalesOrderNumber>
                <ns1:CustPONbr>14753003</ns1:CustPONbr>
                <ns1:ConNoteNumber>16TZ00000907</ns1:ConNoteNumber>
                <ns1:TrackingURL>http://fulfilment-d.linfox.com/tracking/cpF%2frfRkhN7OouBSGyglVg%3d%3d</ns1:TrackingURL>
                <ns1:AddnRefDetails1></ns1:AddnRefDetails1>
                <ns1:AddnRefDetails2></ns1:AddnRefDetails2>
                <ns1:AddnRefDetails3/>
                <ns1:TransportProvider>STE</ns1:TransportProvider>
                <ns1:TransportProviderName>Startrack Road Express</ns1:TransportProviderName>
                <ns1:ShipSrvCode>EXP</ns1:ShipSrvCode>
                <ns1:TotalPalletsCount>0</ns1:TotalPalletsCount>
                <ns1:TotalCaseCount>0</ns1:TotalCaseCount>
                <ns1:TotalShipWeight>0.01</ns1:TotalShipWeight>
                <ns1:TotalShipWeightUOM>KG</ns1:TotalShipWeightUOM>
            </ns1:GIHeader>
            <ns1:GIItemLevel>
                <ns1:GIItem>
                    <ns1:ShpOdrLineItemNo>46810711</ns1:ShpOdrLineItemNo>
                    <ns1:LfxShpOdrLineItemNo>1</ns1:LfxShpOdrLineItemNo>
                    <ns1:AddnRefDetails1/>
                    <ns1:AddnRefDetails2/>
                    <ns1:AddnRefDetails3/>
                    <ns1:AddnRefDetails4/>
                    <ns1:AddnRefDetails5></ns1:AddnRefDetails5>
                    <ns1:MaterialCode>22868A3L791AU10M-BLS</ns1:MaterialCode>
                    <ns1:GTINCode>2286820722868480018</ns1:GTINCode>
                    <ns1:MaterialName>CABLE,CAT5E,UTP,RJ45M/M,10M,BLU,PATCH,SNAGLESS</ns1:MaterialName>
                    <ns1:OrderQuantity>6</ns1:OrderQuantity>
                    <ns1:BaseUOM>EA</ns1:BaseUOM>
                    <ns1:BackOrderQuantity>6</ns1:BackOrderQuantity>
                    <ns1:StockCategoryType>G02</ns1:StockCategoryType>
                    <ns1:PGIQuantity>0</ns1:PGIQuantity>
                </ns1:GIItem>
            </ns1:GIItemLevel>
            <ns1:HandlingUnitDetails>   </ns1:HandlingUnitDetails>
        </ns1:PostGoodsIssue>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>